liaoyanbang/Smart_car/电磁四轮组演示程序/LQSTCdemo_diancisilun211217/user/STC16F.h
/*LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLL
【平    台】北京龙邱智能科技STC16核心板
【修    改】chiusir
【最后更新】2021年1月23日
【相关信息参考下列地址】
【网    站】http://www.lqist.cn
【淘宝店铺】http://longqiu.taobao.com
------------------------------------------------
【IDE】STC16
【Target 】 C251Keil5.6及以上
【SYS PLL】 30MHz使用内部晶振
=================================================================
STC16相关配套视频：
龙邱科技B站网址：https://space.bilibili.com/95313236
STC16环境下载参考视频： https://www.bilibili.com/video/BV1gy4y1p7T1/
STC16一体板子介绍视频： https://www.bilibili.com/video/BV1Jy4y1e7R4/
=================================================================
下载时, 选择时钟 30MHZ (用户可自行修改频率).
STC16F初次下载:先用IRCBND=0，ISP界面设置为24M，
然后IRCBND=0，下载频率为30M；
或者IRCBND=1，下载频率为30M；好用为准
QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ*/
#ifndef __STC16F_H__
#define __STC16F_H__

/////////////////////////////////////////////////
//SFR:80H-SFR:FFH
/////////////////////////////////////////////////

sfr P0              =   0x80;
sbit P00            =   P0^0;
sbit P01            =   P0^1;
sbit P02            =   P0^2;
sbit P03            =   P0^3;
sbit P04            =   P0^4;
sbit P05            =   P0^5;
sbit P06            =   P0^6;
sbit P07            =   P0^7;
sfr SP              =   0x81;
sfr DPL             =   0x82;
sfr DPH             =   0x83;
sfr DPXL            =   0x84;
sfr USBCLK          =   0x85;
sfr DPS             =   0x86;
sfr PCON            =   0x87;
//sbit IDL            =   PCON^0;
//sbit PD             =   PCON^1;
//sbit GF0            =   PCON^2;
//sbit GF1            =   PCON^3;
//sbit POF            =   PCON^4;
//sbit LVDF           =   PCON^5;
//sbit SMOD0          =   PCON^6;
//sbit SMOD           =   PCON^7;
sfr TCON            =   0x88;
sbit IT0            =   TCON^0;
sbit IE0            =   TCON^1;
sbit IT1            =   TCON^2;
sbit IE1            =   TCON^3;
sbit TR0            =   TCON^4;
sbit TF0            =   TCON^5;
sbit TR1            =   TCON^6;
sbit TF1            =   TCON^7;
sfr TMOD            =   0x89;
sfr TL0             =   0x8a;
sfr TL1             =   0x8b;
sfr TH0             =   0x8c;
sfr TH1             =   0x8d;
sfr CKCON           =   0x8e;
sfr DMAIR           =   0x8f;
sfr P1              =   0x90;
sbit P10            =   P1^0;
sbit P11            =   P1^1;
sbit P12            =   P1^2;
sbit P13            =   P1^3;
sbit P14            =   P1^4;
sbit P15            =   P1^5;
sbit P16            =   P1^6;
sbit P17            =   P1^7;
sfr USBCON          =   0x91;
sfr WTST            =   0x92;
sfr AUXR            =   0x93;
//sbit S2BRS          =   AUXR^0;
//sbit EXRAM          =   AUXR^1;
//sbit T2x12          =   AUXR^2;
//sbit T2CT           =   AUXR^3;
//sbit TR2            =   AUXR^4;
//sbit S1M0x6         =   AUXR^5;
//sbit T1x12          =   AUXR^6;
//sbit T0x12          =   AUXR^7;
sfr AUXR2           =   0x94;
#define P40ADR    0x40
#define ADIBF     0x20
#define TXLINRX   0x10
#define USBEN     0x04
#define CANEN     0x02
#define LINEN     0x01
sfr INTCLKO         =   0x95;
//sbit T0CLKO         =   INTCLKO^0;
//sbit T1CLKO         =   INTCLKO^1;
//sbit T2CLKO         =   INTCLKO^2;
//sbit EX2            =   INTCLKO^4;
//sbit EX3            =   INTCLKO^5;
//sbit EX4            =   INTCLKO^6;
sfr USBADR          =   0x96;
sbit USBBUSY        =   USBADR^7;
sfr USBDAT          =   0x97;
sfr SCON            =   0x98;
sbit RI             =   SCON^0;
sbit TI             =   SCON^1;
sbit RB8            =   SCON^2;
sbit TB8            =   SCON^3;
sbit REN            =   SCON^4;
sbit SM2            =   SCON^5;
sbit SM1            =   SCON^6;
sbit SM0            =   SCON^7;
sfr SBUF            =   0x99;
sfr P_SW1           =   0x9a;
sfr P_SW2           =   0x9b;
sfr BGTRIM          =   0x9c;
sfr VRTRIM          =   0x9d;
sfr LIRTRIM         =   0x9e;
sfr IRTRIM          =   0x9f;
sfr P2              =   0xa0;
sbit P20            =   P2^0;
sbit P21            =   P2^1;
sbit P22            =   P2^2;
sbit P23            =   P2^3;
sbit P24            =   P2^4;
sbit P25            =   P2^5;
sbit P26            =   P2^6;
sbit P27            =   P2^7;
sfr CANICR          =   0xa1;
sfr CANAR           =   0xa2;
sfr CANDR           =   0xa3;
sfr MACDR0          =   0xa4;
sfr MACDR1          =   0xa5;
sfr MACDR2          =   0xa6;
sfr MACDR3          =   0xa7;
sfr IE              =   0xa8;
sbit EX0            =   IE^0;
sbit ET0            =   IE^1;
sbit EX1            =   IE^2;
sbit ET1            =   IE^3;
sbit ES             =   IE^4;
sbit EADC           =   IE^5;
sbit ELVD           =   IE^6;
sbit EA             =   IE^7;
sfr IRCBAND         =   0xa9;
sfr WKTCL           =   0xaa;
sfr WKTCH           =   0xab;
sfr VOCTRL          =   0xac;
sfr VOSEL           =   0xad;
sfr MACADDR         =   0xae;
sfr MACDATA         =   0xaf;
sfr P3              =   0xb0;
sbit P30            =   P3^0;
sbit P31            =   P3^1;
sbit P32            =   P3^2;
sbit P33            =   P3^3;
sbit P34            =   P3^4;
sbit P35            =   P3^5;
sbit P36            =   P3^6;
sbit P37            =   P3^7;
sfr LINICR          =   0xb1;
sfr LINAR           =   0xb2;
sfr LINDR           =   0xb3;
sfr CMPCR1          =   0xb4;
//sbit CMPRES         =   CMPCR1^0;
//sbit CMPOE          =   CMPCR1^1;
//sbit CMPNIS         =   CMPCR1^2;
//sbit CMPPIS         =   CMPCR1^3;
//sbit CMPNIE         =   CMPCR1^4;
//sbit CMPPIE         =   CMPCR1^5;
//sbit CMPIF          =   CMPCR1^6;
//sbit CMPEN          =   CMPCR1^7;
sfr CMPCR2          =   0xb5;
//sbit DISFLT         =   CMPCR2^6;
//sbit INVCMPO        =   CMPCR2^7;
sfr IP2H            =   0xb6;
//sbit PS2H           =   IP2H^0;
//sbit PSPIH          =   IP2H^1;
//sbit PUSBH          =   IP2H^2;
//sbit PPWM2H         =   IP2H^3;
//sbit PX4H           =   IP2H^4;
//sbit PCMPH          =   IP2H^5;
//sbit PSSBH          =   IP2H^6;
sfr IPH             =   0xb7;
//sbit PX0H           =   IPH^0;
//sbit PT0H           =   IPH^1;
//sbit PX1H           =   IPH^2;
//sbit PT1H           =   IPH^3;
//sbit PS0H           =   IPH^4;
//sbit PSH            =   IPH^4;
//sbit PADCH          =   IPH^5;
//sbit PLVDH          =   IPH^6;
//sbit PPWM1H         =   IPH^7;
sfr IP              =   0xb8;
sbit PX0            =   IP^0;
sbit PT0            =   IP^1;
sbit PX1            =   IP^2;
sbit PT1            =   IP^3;
sbit PS0            =   IP^4;
sbit PS             =   IP^4;
sbit PADC           =   IP^5;
sbit PLVD           =   IP^6;
sbit PPWM1          =   IP^7;
sfr SPSTAT          =   0xb9;
//sbit WCOL           =   SPSTAT^6;
//sbit SPIF           =   SPSTAT^7;
#define SPIF    0x80        //SPI传输完成标志。写入1清0。
#define WCOL    0x40        //SPI写冲突标志。写入1清0。
sfr SPCTL           =   0xba;
//sbit CPHA           =   SPCTL^2;
//sbit CPOL           =   SPCTL^3;
//sbit MSTR           =   SPCTL^4;
//sbit DORD           =   SPCTL^5;
//sbit SPEN           =   SPCTL^6;
//sbit SSIG           =   SPCTL^7;
sfr SPDAT           =   0xbb;
sfr S4CON           =   0xbc;
//sbit S4RI           =   S4CON^0;
//sbit S4TI           =   S4CON^1;
//sbit S4RB8          =   S4CON^2;
//sbit S4TB8          =   S4CON^3;
//sbit S4REN          =   S4CON^4;
//sbit S4SM2          =   S4CON^5;
//sbit S4SM1          =   S4CON^6;
//sbit S4SM0          =   S4CON^7;
sfr S4BUF           =   0xbd;
sfr SPH             =   0xbe;
sfr BUS_SPEED       =   0xbf;
sfr P4              =   0xc0;
sbit P40            =   P4^0;
sbit P41            =   P4^1;
sbit P42            =   P4^2;
sbit P43            =   P4^3;
sbit P44            =   P4^4;
sbit P45            =   P4^5;
sbit P46            =   P4^6;
sbit P47            =   P4^7;
sfr DID             =   0xc1;
sfr IAP_DATA        =   0xc2;
sfr IAP_ADDRH       =   0xc3;
sfr IAP_ADDRL       =   0xc4;
sfr IAP_CMD         =   0xc5;
sfr IAP_TRIG        =   0xc6;
sfr IAP_CONTR       =   0xc7;
sfr P5              =   0xc8;
sbit P50            =   P5^0;
sbit P51            =   P5^1;
sbit P52            =   P5^2;
sbit P53            =   P5^3;
sbit P54            =   P5^4;
sbit P55            =   P5^5;
sbit P56            =   P5^6;
sbit P57            =   P5^7;
sfr T4H             =   0xc9;
sfr T4L             =   0xca;
sfr T3H             =   0xcb;
sfr T3L             =   0xcc;
sfr T2H             =   0xcd;
sfr T2L             =   0xce;
sfr DEVICE          =   0xcf;
sfr PSW             =   0xd0;
sbit P              =   PSW^0;
sbit F1             =   PSW^1;
sbit OV             =   PSW^2;
sbit RS0            =   PSW^3;
sbit RS1            =   PSW^4;
sbit F0             =   PSW^5;
sbit AC             =   PSW^6;
sbit CY             =   PSW^7;
sfr PSW1            =   0xd1;
//sbit Z              =   PSW1^1;
//sbit N              =   PSW1^5;
sfr P7M1            =   0xd2;
sfr P7M0            =   0xd3;
sfr RTCCON          =   0xd4;
sfr RTCSEC          =   0xd5;
sfr RTCREG          =   0xd6;
sfr RTCICR          =   0xd7;
sfr RSTIF           =   0xd8;
sfr ICECR           =   0xd9;
//sbit ICEPIF         =   ICECR^0;
//sbit BRKIF          =   ICECR^1;
//sbit EICEPI         =   ICECR^4;
//sbit EBRKI          =   ICECR^5;
//sbit REITS          =   ICECR^6;
//sbit ICEON          =   ICECR^7;
sfr AUXINTIF        =   0xda;
//sbit T2IF           =   AUXINTIF^0;
//sbit T3IF           =   AUXINTIF^1;
//sbit T4IF           =   AUXINTIF^2;
//sbit INT2IF         =   AUXINTIF^4;
//sbit INT3IF         =   AUXINTIF^5;
//sbit INT4IF         =   AUXINTIF^6;
sfr T4T3M           =   0xdb;
//sbit T3CLKO         =   T4T3M^0;
//sbit T3x12          =   T4T3M^1;
//sbit T3CT           =   T4T3M^2;
//sbit T3R            =   T4T3M^3;
//sbit T4CLKO         =   T4T3M^4;
//sbit T4x12          =   T4T3M^5;
//sbit T4CT           =   T4T3M^6;
//sbit T4R            =   T4T3M^7;
sfr ADC_CONTR       =   0xdc;
//sbit ADC_FLAG       =   ADC_CONTR^5;
//sbit ADC_START      =   ADC_CONTR^6;
//sbit ADC_POWER      =   ADC_CONTR^7;
sfr ADC_RES         =   0xdd;
sfr ADC_RESL        =   0xde;
sfr ADCCFG          =   0xdf;
sfr ACC             =   0xe0;
sfr SADDR           =   0xe1;
sfr SADEN           =   0xe2;
sfr S2CON           =   0xe3;
//sbit S2RI           =   S2CON^0;
//sbit S2TI           =   S2CON^1;
//sbit S2RB8          =   S2CON^2;
//sbit S2TB8          =   S2CON^3;
//sbit S2REN          =   S2CON^4;
//sbit S2SM2          =   S2CON^5;
//sbit S2SM0          =   S2CON^7;
sfr S2BUF           =   0xe4;
sfr S3CON           =   0xe5;
//sbit S3RI           =   S3CON^0;
//sbit S3TI           =   S3CON^1;
//sbit S3RB8          =   S3CON^2;
//sbit S3TB8          =   S3CON^3;
//sbit S3REN          =   S3CON^4;
//sbit S3SM2          =   S3CON^5;
//sbit S3SM1          =   S3CON^6;
//sbit S3SM0          =   S3CON^7;
sfr S3BUF           =   0xe6;
sfr IE2             =   0xe7;
sbit ES2            =   IE2^0;
sbit ESPI           =   IE2^1;
sbit ET2            =   IE2^2;
sbit ES3            =   IE2^3;
sbit ES4            =   IE2^4;
sbit ET3            =   IE2^5;
sbit ET4            =   IE2^6;
sfr P6              =   0xe8;
sbit P60            =   P6^0;
sbit P61            =   P6^1;
sbit P62            =   P6^2;
sbit P63            =   P6^3;
sbit P64            =   P6^4;
sbit P65            =   P6^5;
sbit P66            =   P6^6;
sbit P67            =   P6^7;
sfr STATUS          =   0xe9;
sfr MXAX            =   0xea;
sfr TA              =   0xeb;
sfr P5M1            =   0xec;
sfr P5M0            =   0xed;
sfr P6M1            =   0xee;
sfr P6M0            =   0xef;
sfr B               =   0xf0;
sfr P0M1            =   0xf1;
sfr P0M0            =   0xf2;
sfr P1M1            =   0xf3;
sfr P1M0            =   0xf4;
sfr P2M1            =   0xf5;
sfr P2M0            =   0xf6;
sfr IAP_TPS         =   0xf7;
sfr P7              =   0xf8;
sbit P70            =   P7^0;
sbit P71            =   P7^1;
sbit P72            =   P7^2;
sbit P73            =   P7^3;
sbit P74            =   P7^4;
sbit P75            =   P7^5;
sbit P76            =   P7^6;
sbit P77            =   P7^7;
sfr P3M1            =   0xf9;
sfr P3M0            =   0xfa;
sfr P4M1            =   0xfb;
sfr P4M0            =   0xfc;
sfr WDT_CONTR       =   0xfd;
sfr IP2             =   0xfe;
//sbit PS2            =   IP2^0;
//sbit PSPI           =   IP2^1;
//sbit PUSB           =   IP2^2;
//sbit PPWM2          =   IP2^3;
//sbit PX4            =   IP2^4;
//sbit PCMP           =   IP2^5;
//sbit PSSB           =   IP2^6;
sfr RSTCFG          =   0xff;
//sbit P54RST         =   RSTCFG^4;
//sbit ENLVR          =   RSTCFG^6;

/////////////////////////////////////////////////
//7E:FF00H-7E:FFFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FE00H-7E:FEFFH
/////////////////////////////////////////////////

