liaoyanbang/Smart_car/电磁四轮组演示程序/LQSTCdemo_diancisilun211217/user/STC16F.h
#define CLKSEL              (*(unsigned char volatile far *)0x7efe00)
#define CLKDIV              (*(unsigned char volatile far *)0x7efe01)
#define IRC24MCR            (*(unsigned char volatile far *)0x7efe02)
#define XOSCCR              (*(unsigned char volatile far *)0x7efe03)
#define IRC32KCR            (*(unsigned char volatile far *)0x7efe04)
#define PLLCR               (*(unsigned char volatile far *)0x7efe05)
#define USBCON1             (*(unsigned char volatile far *)0x7efe06)
#define MCLKOCR             (*(unsigned char volatile far *)0x7efe07)
#define IRC48MCR            (*(unsigned char volatile far *)0x7efe08)
#define IRC48ATRIM          (*(unsigned char volatile far *)0x7efe09)
#define IRC48BTRIM          (*(unsigned char volatile far *)0x7efe0a)
#define IRCDB               (*(unsigned char volatile far *)0x7efe0b)

#define P0PU                (*(unsigned char volatile far *)0x7efe10)
#define P1PU                (*(unsigned char volatile far *)0x7efe11)
#define P2PU                (*(unsigned char volatile far *)0x7efe12)
#define P3PU                (*(unsigned char volatile far *)0x7efe13)
#define P4PU                (*(unsigned char volatile far *)0x7efe14)
#define P5PU                (*(unsigned char volatile far *)0x7efe15)
#define P6PU                (*(unsigned char volatile far *)0x7efe16)
#define P7PU                (*(unsigned char volatile far *)0x7efe17)
#define P0NCS               (*(unsigned char volatile far *)0x7efe18)
#define P1NCS               (*(unsigned char volatile far *)0x7efe19)
#define P2NCS               (*(unsigned char volatile far *)0x7efe1a)
#define P3NCS               (*(unsigned char volatile far *)0x7efe1b)
#define P4NCS               (*(unsigned char volatile far *)0x7efe1c)
#define P5NCS               (*(unsigned char volatile far *)0x7efe1d)
#define P6NCS               (*(unsigned char volatile far *)0x7efe1e)
#define P7NCS               (*(unsigned char volatile far *)0x7efe1f)
#define P0SR                (*(unsigned char volatile far *)0x7efe20)
#define P1SR                (*(unsigned char volatile far *)0x7efe21)
#define P2SR                (*(unsigned char volatile far *)0x7efe22)
#define P3SR                (*(unsigned char volatile far *)0x7efe23)
#define P4SR                (*(unsigned char volatile far *)0x7efe24)
#define P5SR                (*(unsigned char volatile far *)0x7efe25)
#define P6SR                (*(unsigned char volatile far *)0x7efe26)
#define P7SR                (*(unsigned char volatile far *)0x7efe27)
#define P0DR                (*(unsigned char volatile far *)0x7efe28)
#define P1DR                (*(unsigned char volatile far *)0x7efe29)
#define P2DR                (*(unsigned char volatile far *)0x7efe2a)
#define P3DR                (*(unsigned char volatile far *)0x7efe2b)
#define P4DR                (*(unsigned char volatile far *)0x7efe2c)
#define P5DR                (*(unsigned char volatile far *)0x7efe2d)
#define P6DR                (*(unsigned char volatile far *)0x7efe2e)
#define P7DR                (*(unsigned char volatile far *)0x7efe2f)
#define P0IE                (*(unsigned char volatile far *)0x7efe30)
#define P1IE                (*(unsigned char volatile far *)0x7efe31)

#define I2CCFG              (*(unsigned char volatile far *)0x7efe80)
#define ENI2C               0x80
#define I2CMASTER           0x40
#define I2CSLAVE            0x00
#define I2CMSCR             (*(unsigned char volatile far *)0x7efe81)
#define EMSI                0x80
#define MS_IDLE                     0x00
#define MS_START                    0x01
#define MS_SENDDAT                  0x02
#define MS_RECVACK                  0x03
#define MS_RECVDAT                  0x04
#define MS_SENDACK                  0x05
#define MS_STOP                     0x06
#define MS_START_SENDDAT_RECVACK    0x09
#define MS_SENDDAT_RECVACK          0x0a
#define MS_RECVDAT_SENDACK          0x0b
#define MS_RECVDAT_SENDNAK          0x0c
#define I2CMSST             (*(unsigned char volatile far *)0x7efe82)
#define MSBUSY              0x80
#define MSIF                0x40
#define MSACKI              0x02
#define MSACKO              0x01
#define I2CSLCR             (*(unsigned char volatile far *)0x7efe83)
#define ESTAI               0x40
#define ERXI                0x20
#define ETXI                0x10
#define ESTOI               0x08
#define SLRST               0x01
#define I2CSLST             (*(unsigned char volatile far *)0x7efe84)
#define SLBUSY              0x80
#define STAIF               0x40
#define RXIF                0x20
#define TXIF                0x10
#define STOIF               0x08
#define TXING               0x04
#define SLACKI              0x02
#define SLACKO              0x01
#define I2CSLADR            (*(unsigned char volatile far *)0x7efe85)
#define I2CTXD              (*(unsigned char volatile far *)0x7efe86)
#define I2CRXD              (*(unsigned char volatile far *)0x7efe87)
#define I2CMSAUX            (*(unsigned char volatile far *)0x7efe88)

#define TIMER2PS            (*(unsigned char volatile far *)0x7efea2)
#define TIMER3PS            (*(unsigned char volatile far *)0x7efea3)
#define TIMER4PS            (*(unsigned char volatile far *)0x7efea4)

#define ADCTIM              (*(unsigned char volatile far *)0x7efeab)
#define T3T4PS              (*(unsigned char volatile far *)0x7efeac)

#define PWM1_ETRPS          (*(unsigned char volatile far *)0x7efeb0)
#define PWM1_ENO            (*(unsigned char volatile far *)0x7efeb1)
#define PWM1_PS             (*(unsigned char volatile far *)0x7efeb2)
#define PWM1_IOAUX          (*(unsigned char volatile far *)0x7efeb3)
#define PWM2_ETRPS          (*(unsigned char volatile far *)0x7efeb4)
#define PWM2_ENO            (*(unsigned char volatile far *)0x7efeb5)
#define PWM2_PS             (*(unsigned char volatile far *)0x7efeb6)
#define PWM2_IOAUX          (*(unsigned char volatile far *)0x7efeb7)

#define PWMA_ETRPS          (*(unsigned char volatile far *)0x7efeb0)
#define PWMA_ENO            (*(unsigned char volatile far *)0x7efeb1)
#define PWMA_PS             (*(unsigned char volatile far *)0x7efeb2)
#define PWMA_IOAUX          (*(unsigned char volatile far *)0x7efeb3)
#define PWMB_ETRPS          (*(unsigned char volatile far *)0x7efeb4)
#define PWMB_ENO            (*(unsigned char volatile far *)0x7efeb5)
#define PWMB_PS             (*(unsigned char volatile far *)0x7efeb6)
#define PWMB_IOAUX          (*(unsigned char volatile far *)0x7efeb7)

