liaoyanbang/Smart_car/电磁四轮组演示程序/LQSTCdemo_diancisilun211217/user/STC16F.h
#define PWMB_CR1            (*(unsigned char volatile far *)0x7efee0)
#define PWMB_CR2            (*(unsigned char volatile far *)0x7efee1)
#define PWMB_SMCR           (*(unsigned char volatile far *)0x7efee2)
#define PWMB_ETR            (*(unsigned char volatile far *)0x7efee3)
#define PWMB_IER            (*(unsigned char volatile far *)0x7efee4)
#define PWMB_SR1            (*(unsigned char volatile far *)0x7efee5)
#define PWMB_SR2            (*(unsigned char volatile far *)0x7efee6)
#define PWMB_EGR            (*(unsigned char volatile far *)0x7efee7)
#define PWMB_CCMR1          (*(unsigned char volatile far *)0x7efee8)
#define PWMB_CCMR2          (*(unsigned char volatile far *)0x7efee9)
#define PWMB_CCMR3          (*(unsigned char volatile far *)0x7efeea)
#define PWMB_CCMR4          (*(unsigned char volatile far *)0x7efeeb)
#define PWMB_CCER1          (*(unsigned char volatile far *)0x7efeec)
#define PWMB_CCER2          (*(unsigned char volatile far *)0x7efeed)
#define PWMB_CNTRH          (*(unsigned char volatile far *)0x7efeee)
#define PWMB_CNTRL          (*(unsigned char volatile far *)0x7efeef)
#define PWMB_PSCRH          (*(unsigned char volatile far *)0x7efef0)
#define PWMB_PSCRL          (*(unsigned char volatile far *)0x7efef1)
#define PWMB_ARRH           (*(unsigned char volatile far *)0x7efef2)
#define PWMB_ARRL           (*(unsigned char volatile far *)0x7efef3)
#define PWMB_RCR            (*(unsigned char volatile far *)0x7efef4)
#define PWMB_CCR1H          (*(unsigned char volatile far *)0x7efef5)
#define PWMB_CCR1L          (*(unsigned char volatile far *)0x7efef6)
#define PWMB_CCR2H          (*(unsigned char volatile far *)0x7efef7)
#define PWMB_CCR2L          (*(unsigned char volatile far *)0x7efef8)
#define PWMB_CCR3H          (*(unsigned char volatile far *)0x7efef9)
#define PWMB_CCR3L          (*(unsigned char volatile far *)0x7efefa)
#define PWMB_CCR4H          (*(unsigned char volatile far *)0x7efefb)
#define PWMB_CCR4L          (*(unsigned char volatile far *)0x7efefc)
#define PWMB_BKR            (*(unsigned char volatile far *)0x7efefd)
#define PWMB_DTR            (*(unsigned char volatile far *)0x7efefe)
#define PWMB_OISR           (*(unsigned char volatile far *)0x7efeff)

/////////////////////////////////////////////////
//7E:FD00H-7E:FDFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FC00H-7E:FCFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FB00H-7E:FBFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FA00H-7E:FAFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//DCAN Control Regiter
/////////////////////////////////////////////////

#define MR       0x00 
#define CMR      0x01 
#define SR       0x02 
#define ISR      0x03 
#define IMR      0x04 
#define RMC      0x05 
#define BTR0     0x06 
#define BTR1     0x07 
#define TM0      0x06 
#define TM1      0x07 
#define TX_BUF0  0x08 
#define TX_BUF1  0x09 
#define TX_BUF2  0x0a 
#define TX_BUF3  0x0b 
#define RX_BUF0  0x0c 
#define RX_BUF1  0x0d 
#define RX_BUF2  0x0e 
#define RX_BUF3  0x0f 
#define ACR0     0x10 
#define ACR1     0x11 
#define ACR2     0x12 
#define ACR3     0x13 
#define AMR0     0x14 
#define AMR1     0x15 
#define AMR2     0x16 
#define AMR3     0x17 
#define ECC      0x18 
#define TXERR    0x19 
#define RXERR    0x1a 
#define ALC      0x1b 

/////////////////////////////////////////////////

#define INT0_VECTOR         0       //0003H
#define TMR0_VECTOR         1       //000BH
#define INT1_VECTOR         2       //0013H
#define TMR1_VECTOR         3       //001BH
#define UART1_VECTOR        4       //0023H
#define ADC_VECTOR          5       //002BH
#define LVD_VECTOR          6       //0033H
#define PWM1_VECTOR         7       //003BH
#define UART2_VECTOR        8       //0043H
#define SPI_VECTOR          9       //004BH
#define INT2_VECTOR         10      //0053H
#define INT3_VECTOR         11      //005BH
#define TMR2_VECTOR         12      //0063H
#define USER_VECTOR         13      //006BH
#define INT4_VECTOR         16      //0083H
#define UART3_VECTOR        17      //008BH
#define UART4_VECTOR        18      //0093H
#define TMR3_VECTOR         19      //009BH
#define TMR4_VECTOR         20      //00A3H
#define CMP_VECTOR          21      //00ABH
#define USB_VECTOR          22      //00B3H
#define PWM2_VECTOR         23      //00BBH
#define I2C_VECTOR          24      //00C3H
#define CAN_VECTOR          28      //00E3H
#define LIN_VECTOR          29      //00EBH

/////////////////////////////////////////////////

#endif

